import 'dart:io';

void main() {
  print("ข้อที่.1");
  print("Welcome to Dart\n");

  var planet = "Earth";
  print("ข้อที่.2");
  print("$planet\n");

  int myAge = 17;
  print("ข้อที่.3");
  print("$myAge\n");

  double piValue = 3.14159;
  print("ข้อที่.4");
  print("$piValue\n");

  bool isDartFun = true;
  print("ข้อที่.5");
  print("$isDartFun\n");

  var a = 15;
  var b = 4;
  print("ข้อที่.6");
  print("ผลบวกของ a กับ b = ${a + b}\n");

  print("ข้อที่.7");
  print("ผลคูณของ a กับ b = ${a * b}\n");

  var name = "Alice";
  var age = 28;
  print("ข้อที่.8");
  print("My name is ${name} and I am ${age} years old\n");

  print("ข้อที่.9");
  print("มันไม่ได้ครับ มันคนละสปีชี่🦔🔪🐀");

  print("ข้อที่.10");
  print("มันได้ครับ มันสปีชี่เดียวกัน🦔🤝🦔");

  const secondsInMinute = 60;
  print("ข้อที่.11");
  print("เก็บละครับ");

  print("ข้อที่.12");
  print("มันได้ครับ มันสปีชี่เดียวกัน🤖🤝🤖");

  var x = 10;
  var y = 4;
  print("ข้อที่.13");
  print("ผลหารของ x กับ b = ${x / y}\n");
  print("ชนิดของมันคือ int");

  print("ข้อที่.14");
  print("ผลยึกยือแล้วหารของ x กับ b = ${x ~/ y}\n");
  print("ชนิดของมันคือ int");

  print("ข้อที่.15");
  print("ผลหารของ x กับ b = ${x % y}\n");
  print("ชนิดของมันคือ int");

  int score = 80;
  bool isPass = score < 80;
  bool isGradeA = score >= 80;
  print("ข้อที่.16");
  print('true: $isPass');
  print('true: $isGradeA\n');

  print("ข้อที่.17");
  print("Score: ${score != 100}");
}
